entries/2018.org
#+hugo_section: 2018
#+hugo_base_dir: ../
#+STARTUP: content
#+macro: latex @@html:<span class="latex">L<sup>A</sup>T<sub>E</sub>X</span>@@

** DONE 数式の展開テスト                                              :@hugo:
   CLOSED: [2018-08-21 Tue 02:05]
:PROPERTIES:
:EXPORT_FILE_NAME: a-mathjax-text
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :mathjax true
:CREATED:  [2018-08-21 Tue 02:04]
:END:
*** inline
An inline equation $f(x)$.

*** stand alone without numbering
A standalone equation:
$$ E = mc^{2} $$

*** full equation with numbering

+*うまくいかない* 通常のHTML出力では正しく式番号がレンダリングされる．+

=ox-hugo= の設定では，

#+begin_quote
https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.5/MathJax.js?config=TeX-AMS-MML_HTMLorMML
#+end_quote

だが，通常のHTML出力では，

#+begin_quote
https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.0/MathJax.js?config=TeX-AMS_HTML
#+end_quote

である．

And a full {{{latex}}} equation will be displayed as

\begin{equation}
\label{eq:1}
C = W\log_{2} (1+\mathrm{SNR})
\end{equation}

, and could be referenced by (\ref{eq:1}).

最終的に，リファレンスに示された =mathjax-config.js= を利用すればOK．

導入は， =./static/js/mathjax-config.js= として [[https://ox-hugo.scripter.co/js/mathjax-config.js][mathjax-config.js]] を保存し，テーマの中で =mathjax= のスクリプトを記述している箇所に，以下を追加する．

#+begin_src javascript
<!--
 https://github.com/mathjax/MathJax/issues/1988#issuecomment-384978927
 Use plain Javascript to prevent the use of window.eval(). Then
 'unsafe-eval' won't be needed to be added to script-src CSP.
 Also move the mathjax config to a separate file from the inline script so
 that 'unsafe-inline can also be removed from script-src CSP.
-->
<script src="{{ "js/mathjax-config.js" | absURL }}"></script>
#+end_src

これで式番号と =\ref= が効くようになる．

=ox-hugo= の設定は，以下（本来の値）でOKだった．

#+begin_quote
https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.5/MathJax.js?config=TeX-AMS-MML_HTMLorMML
#+end_quote

*** References
 - https://github.com/kaushalmodi/hugo-bare-min-theme/blob/master/layouts/partials/mathjax.html
 - https://ox-hugo.scripter.co/js/mathjax-config.js
